import React from "react";
import {
  CarouselProvider,
  Slider,
  Slide,
  ButtonBack,
  ButtonNext,
} from "pure-react-carousel";
import "pure-react-carousel/dist/react-carousel.es.css";
import firstReviews from "../assets/review/first_foto.jpg";
import secondReviews from "../assets/review/second_foto.jpg";
import thirdReviews from "../assets/review/third_foto.jpg";
import a from "../style/review.module.css";
import leftArrow from "../assets/review/left-arrow.png";
import rightArrow from "../assets/review/right-arrow.png";

export default class extends React.Component {
  render() {
    return (
      <CarouselProvider
        naturalSlideWidth={100}
        naturalSlideHeight={50}
        totalSlides={3}
      >
        <Slider>
          <Slide index={0}>
            <div className={a.review_box}>
              <div className={a.review_text}>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="40"
                  height="40"
                  viewBox="0 0 40 40"
                  fill="none"
                >
                  <g opacity="0.9">
                    <path
                      d="M8.78049 15.9902C13.6083 15.9902 17.522 19.904 17.522 24.7317C17.522 29.5594 13.6083 33.4732 8.78049 33.4732C3.9527 33.4732 0.0390244 29.5594 0.0390244 24.7317L0 23.4829C0 13.8274 7.82736 6 17.4829 6V10.9951C14.1474 10.9951 11.0114 12.2941 8.65272 14.6527C8.19871 15.1068 7.78435 15.5899 7.41058 16.0974C7.85694 16.0272 8.31438 15.9902 8.78049 15.9902ZM31.2585 15.9902C36.0862 15.9902 40 19.904 40 24.7317C40 29.5594 36.0862 33.4732 31.2585 33.4732C26.4308 33.4732 22.5171 29.5594 22.5171 24.7317L22.478 23.4829C22.478 13.8274 30.3053 6 39.961 6V10.9951C36.6255 10.9951 33.4893 12.2941 31.1308 14.6527C30.6767 15.1068 30.2623 15.5899 29.8885 16.0974C30.3349 16.0272 30.7924 15.9902 31.2585 15.9902Z"
                      fill="#5D6AFB"
                    />
                  </g>
                </svg>
                <h2>"Результат неймовірно порадував, друзі були в захваті"</h2>
                <p>
                  Нещодавно замовляли суші, дуже задоволені. Доставка швидка,
                  гарне упакування, а самі суші просто смакота. Велике вам
                  дякую!!! 🤗😉 <br />
                  Раджу спробувати суші від SushiLove.
                </p>
              </div>
              <div>
                <img className={a.foto_style} src={firstReviews} alt="" />
                <h4>Ірина Ларіонова</h4>
              </div>
            </div>
          </Slide>
          <Slide index={1}>
            {" "}
            <div className={a.review_box}>
              <div className={a.review_text}>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="40"
                  height="40"
                  viewBox="0 0 40 40"
                  fill="none"
                >
                  <g opacity="0.9">
                    <path
                      d="M8.78049 15.9902C13.6083 15.9902 17.522 19.904 17.522 24.7317C17.522 29.5594 13.6083 33.4732 8.78049 33.4732C3.9527 33.4732 0.0390244 29.5594 0.0390244 24.7317L0 23.4829C0 13.8274 7.82736 6 17.4829 6V10.9951C14.1474 10.9951 11.0114 12.2941 8.65272 14.6527C8.19871 15.1068 7.78435 15.5899 7.41058 16.0974C7.85694 16.0272 8.31438 15.9902 8.78049 15.9902ZM31.2585 15.9902C36.0862 15.9902 40 19.904 40 24.7317C40 29.5594 36.0862 33.4732 31.2585 33.4732C26.4308 33.4732 22.5171 29.5594 22.5171 24.7317L22.478 23.4829C22.478 13.8274 30.3053 6 39.961 6V10.9951C36.6255 10.9951 33.4893 12.2941 31.1308 14.6527C30.6767 15.1068 30.2623 15.5899 29.8885 16.0974C30.3349 16.0272 30.7924 15.9902 31.2585 15.9902Z"
                      fill="#5D6AFB"
                    />
                  </g>
                </svg>
                <h2>"Дякую за працю, все першокласно!"</h2>
                <p>
                  Дякую за смачні суші, приємні акції та щире ставлення! Дуже
                  часто замовляємо з родиною. Завжди отримуємо неймовірне
                  задоволення! Рибки вдосталь! Все свіженьке! Дитині даю без
                  застережень😉. <br /> Жодних нарікань ні на страви, ні на
                  якість, ні на сервіс не має!
                </p>
              </div>
              <div>
                <img className={a.foto_style} src={secondReviews} alt="" />
                <h4>Олена Демидова</h4>
              </div>
            </div>
          </Slide>
          <Slide index={2}>
            {" "}
            <div className={a.review_box}>
              <div className={a.review_text}>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="40"
                  height="40"
                  viewBox="0 0 40 40"
                  fill="none"
                >
                  <g opacity="0.9">
                    <path
                      d="M8.78049 15.9902C13.6083 15.9902 17.522 19.904 17.522 24.7317C17.522 29.5594 13.6083 33.4732 8.78049 33.4732C3.9527 33.4732 0.0390244 29.5594 0.0390244 24.7317L0 23.4829C0 13.8274 7.82736 6 17.4829 6V10.9951C14.1474 10.9951 11.0114 12.2941 8.65272 14.6527C8.19871 15.1068 7.78435 15.5899 7.41058 16.0974C7.85694 16.0272 8.31438 15.9902 8.78049 15.9902ZM31.2585 15.9902C36.0862 15.9902 40 19.904 40 24.7317C40 29.5594 36.0862 33.4732 31.2585 33.4732C26.4308 33.4732 22.5171 29.5594 22.5171 24.7317L22.478 23.4829C22.478 13.8274 30.3053 6 39.961 6V10.9951C36.6255 10.9951 33.4893 12.2941 31.1308 14.6527C30.6767 15.1068 30.2623 15.5899 29.8885 16.0974C30.3349 16.0272 30.7924 15.9902 31.2585 15.9902Z"
                      fill="#5D6AFB"
                    />
                  </g>
                </svg>
                <h2>"SushiLove - найкращі у своїй справі!"</h2>
                <p>
                  Замовили сьогодні вперше. Для нас - Найкращі суші в місті! Усе
                  збалансовано. Риби/ікри - багато. Сиру "Філадельфія" - як
                  треба. Добавки: соєвий соус, імбир і васабі - величезна
                  кількість! Дуже приємний персонал і моментальна доставка.
                  Рекомендую всім! Ps: Суші величезні і смачні.
                </p>
              </div>
              <div>
                <img className={a.foto_style} src={thirdReviews} alt="" />
                <h4>Тетяна та Денис</h4>
              </div>
            </div>
          </Slide>
        </Slider>
        <ButtonBack className={a.button_style}>
          <img src={leftArrow} alt="" />
        </ButtonBack>
        <ButtonNext className={a.button_style}>
          <img src={rightArrow} alt="" />
        </ButtonNext>
      </CarouselProvider>
    );
  }
}
